/*
 *  linux/drivers/serial/tmpa910.c
 *
 *  Based on drivers/serial/8250.c by Russell King.
 *
<<<<<<< Updated upstream:drivers/serial/tmpa910.c
 *  Copyright:	(C) 2008 Yin, Fengwei (fengwei.yin@gmail.com)
=======
 *  Copyright 2008 bplan GmbH
 *  Copyright 2010 Toshiba Electronics Europe GmbH
>>>>>>> Stashed changes:drivers/serial/tmpa910.c
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
<<<<<<< Updated upstream:drivers/serial/tmpa910.c
 * Note 1: This driver is made separate from the already too overloaded
 * 8250.c because it needs some kirks of its own and that'll make it
 * easier to add DMA support.
 *
 * Note 2: I'm too sick of device allocation policies for serial ports.
 * If someone else wants to request an "official" allocation of major/minor
 * for this driver please be my guest.  And don't forget that new hardware
 * to come from Intel might have more than 3 or 4 of those UARTs.  Let's
 * hope for a better port registration and dynamic device allocation scheme
 * with the serial core maintainer satisfaction to appear soon.
=======
>>>>>>> Stashed changes:drivers/serial/tmpa910.c
 */

#if defined(CONFIG_SERIAL_TMPA910_CONSOLE) && defined(CONFIG_MAGIC_SYSRQ)
	#define SUPPORT_SYSRQ
#endif

<<<<<<< Updated upstream:drivers/serial/tmpa910.c
#if defined(CONFIG_SERIAL_TMPA910_CONSOLE) && defined(CONFIG_MAGIC_SYSRQ)
#define SUPPORT_SYSRQ
#endif

=======
>>>>>>> Stashed changes:drivers/serial/tmpa910.c
#include <linux/module.h>
#include <linux/kernel.h>
#include <linux/ioport.h>
#include <linux/init.h>
#include <linux/console.h>
#include <linux/sysrq.h>
#include <linux/circ_buf.h>
#include <linux/delay.h>
#include <linux/interrupt.h>
#include <linux/platform_device.h>
#include <linux/tty.h>
#include <linux/tty_flip.h>
#include <linux/serial_core.h>
<<<<<<< Updated upstream:drivers/serial/tmpa910.c
=======
#include <linux/ioport.h>
>>>>>>> Stashed changes:drivers/serial/tmpa910.c

#include <asm/io.h>
#include <mach/hardware.h>
#include <asm/irq.h>
<<<<<<< Updated upstream:drivers/serial/tmpa910.c
#include <mach/tmpa910_regs.h>
#include <mach/tmpa910_serial.h>

static int GetUartClock(void);

struct uart_tmpa910_port {
	struct uart_port        port;
	
	unsigned int		ecr;
	unsigned int		mcr;
	unsigned int		rsr;
	unsigned int		fr;
	unsigned int		fbrd;
	unsigned int		brd;
	unsigned int		lcr;
	unsigned int		cr;
	unsigned int		imsc;
	unsigned int		fls;
	unsigned int		icr;
	
	char			*name;
};

static struct uart_driver serial_tmpa910_reg;

static inline unsigned int serial_in(struct uart_tmpa910_port *up, int offset)
=======

#define DRIVER_NAME  	"tmpa910_uart"

#define TMPA910_UART_REGSIZE 0x50
#define TMPA910_SERIAL_MAX 2
#define TMPA910_NAME_PATTERN  "TMPA910 UART Channel %d"

struct tmpa910_uart_regs
{
  uint32_t dr;      // 0x000
  uint32_t sr;      // 0x004
  uint32_t ecr;     // 0x004
  uint32_t rsd1[3]; // 0x008 -> 0x014
  uint32_t fr;      // 0x018
  uint32_t rsd2;    // 0x01c
  uint32_t ilpr;    // 0x020
  uint32_t ibrd;    // 0x024
  uint32_t fbrd;    // 0x028
  uint32_t lcr_h;   // 0x02c
  uint32_t cr;      // 0x030
  uint32_t ifls;    // 0x034
  uint32_t imsc;    // 0x038
  uint32_t ris;     // 0x03c
  uint32_t mis;     // 0x040
  uint32_t icr;     // 0x044
  uint32_t dmacr;   // 0x048
};

/* The data register contains 8bit for the char and 4 status bits */

#define DR_OE  (1<<11)  /* OE RO Undefined Overrun error
                           0y0: There is an empty space in the FIFO.
                           0y1: Overrun error flag */
#define DR_BE  (1<<10)  /* BE RO Undefined Break error
                           0y0: No error detected
                           0y1: Error detected */
#define DR_PE  (1<<9)   /* PE RO Undefined Parity error
                           0y0: No error detected
                           0y1: Error detected */
#define DR_FE  (1<<8)   /* FE RO Undefined Framing error
                           0y0: No error detected
                           0y1: Error detected */

/* The data register contains 8bit for the char and 4 status bits */
#define SR_OE  (1<<3)  
#define SR_BE  (1<<2) 
#define SR_PE  (1<<1) 
#define SR_FE  (1<<0)

#define LCRH_SPS      (1<<7)   SPS  R/W 0y0  Stick parity select:
